### Definição de DataFrame: é um objeto bi-dimensional que contem dados em forma tabular, ou seja, é como se fosse uma tabela do Excel, que é possível adicionar linhas e colunas

In [167]:
import pandas as pd

In [168]:
# Criando DataFrame
df1 = pd.DataFrame ()

In [169]:
df1

Empty DataFrame
Columns: []
Index: []

In [170]:
type(df1)

pandas.core.frame.DataFrame

In [171]:
# importacia de dicionarias
dict1 = {'Identificacao': [1,2,3,4,5],
         'Nome':['Leandro', 'Dulcinea','Theo','Thor','Clarice']}

In [172]:
dict1

{'Identificacao': [1, 2, 3, 4, 5],
 'Nome': ['Leandro', 'Dulcinea', 'Theo', 'Thor', 'Clarice']}

In [173]:
df2 = pd.DataFrame(data= dict1)

In [174]:
df2

   Identificacao      Nome
0              1   Leandro
1              2  Dulcinea
2              3      Theo
3              4      Thor
4              5   Clarice

In [175]:
df3 = pd.DataFrame(data= dict1, index=[29,1,0,2222,88])

In [176]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [177]:
serie1 = pd.Series([1,2,3])

In [178]:
serie1

0    1
1    2
2    3
dtype: int64

In [179]:
type(serie1)

pandas.core.series.Series

In [180]:
serie2 = pd.Series(['a','b','c'])

In [181]:
serie2

0    a
1    b
2    c
dtype: object

In [182]:
df4 = pd.DataFrame({'coluna1':serie1,
                   'coluna2': serie2})

In [183]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

#### Meu treino

In [184]:
Nome_Famila = {'Nome': ['Leandro', 'Dulci','Theo'],
               'Eu souza': ['Pai','Mãe','Filho']}

In [185]:
df_famila = pd.DataFrame(data= Nome_Famila, index=['Marido', 'Esposa','Bebe'])

In [186]:
df_famila

           Nome Eu souza
Marido  Leandro      Pai
Esposa    Dulci      Mãe
Bebe       Theo    Filho

Final de treino

In [187]:
import numpy as np

In [188]:
array1 = np.array([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

In [189]:
array1

array([['1', '2', '3'],
       ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [190]:
type(array1)

numpy.ndarray

In [191]:
df5 = pd.DataFrame(data= array1.transpose(), 
                   index=['linha1','linha2','linha3'],
                   columns =['Identificação','Cidade','Estado'])

In [192]:
df5

       Identificação          Cidade Estado
linha1             1       Sao Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [193]:
matriz1 = np.matrix([[1,2,3],
                   ['Sao Paulo', 'Rio de Janeiro', 'Campinas'],
                   ['SP','RJ','SP']])

### Selecionando DataFrame

In [194]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

### selecionando data frame

In [195]:
df3

      Identificacao      Nome
29                1   Leandro
1                 2  Dulcinea
0                 3      Theo
2222              4      Thor
88                5   Clarice

In [196]:
df3['identificacao_mais_5'] = df3['Identificacao'] + 5

In [197]:
df3

      Identificacao      Nome  identificacao_mais_5
29                1   Leandro                     6
1                 2  Dulcinea                     7
0                 3      Theo                     8
2222              4      Thor                     9
88                5   Clarice                    10

In [198]:
df3['index'] = 0

In [199]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
1                 2  Dulcinea                     7      0
0                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [200]:
df3.index = [29,0,1,2222,88]

In [201]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [202]:
df3['Nome']

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [203]:
df3['index']

29      0
0       0
1       0
2222    0
88      0
Name: index, dtype: int64

In [204]:
df3.Nome

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [205]:
df3[['Nome', 'index']]

          Nome  index
29     Leandro      0
0     Dulcinea      0
1         Theo      0
2222      Thor      0
88     Clarice      0

In [206]:
df3[df3.Identificacao % 2 == 0]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4      Thor                     9      0

In [207]:
df3[df3.Nome.str.contains('T')]

      Identificacao  Nome  identificacao_mais_5  index
1                 3  Theo                     8      0
2222              4  Thor                     9      0

In [208]:
#                                e 
df3[(df3.Nome.str.contains('T')) & (df3.Identificacao  == 3)]

   Identificacao  Nome  identificacao_mais_5  index
1              3  Theo                     8      0

In [209]:
#                               ou 
df3[(df3.Nome.str.contains('T')) | (df3.Identificacao  == 5)]

      Identificacao     Nome  identificacao_mais_5  index
1                 3     Theo                     8      0
2222              4     Thor                     9      0
88                5  Clarice                    10      0

- loc: localiza pelo NOME dos indices ou colunas

- iloc: localiza pela POSIÇÃO dos indices ou colunas

In [210]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [211]:
df3.loc[0]

Identificacao                  2
Nome                    Dulcinea
identificacao_mais_5           7
index                          0
Name: 0, dtype: object

In [212]:
df3.iloc[0]

Identificacao                 1
Nome                    Leandro
identificacao_mais_5          6
index                         0
Name: 29, dtype: object

In [213]:
#     0 ate 1
df3.loc[0:1]

   Identificacao      Nome  identificacao_mais_5  index
0              2  Dulcinea                     7      0
1              3      Theo                     8      0

In [214]:
df3.iloc[0:1]

    Identificacao     Nome  identificacao_mais_5  index
29              1  Leandro                     6      0

In [215]:
df3.iloc[0:2]

    Identificacao      Nome  identificacao_mais_5  index
29              1   Leandro                     6      0
0               2  Dulcinea                     7      0

In [216]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [217]:
df3.loc[88:1:-1]

      Identificacao     Nome  identificacao_mais_5  index
88                5  Clarice                    10      0
2222              4     Thor                     9      0
1                 3     Theo                     8      0

In [218]:
df3.loc[88:1:-2]

    Identificacao     Nome  identificacao_mais_5  index
88              5  Clarice                    10      0
1               3     Theo                     8      0

In [219]:
df3.loc[:,'Nome']

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [220]:
df3.iloc[:,1]

29       Leandro
0       Dulcinea
1           Theo
2222        Thor
88       Clarice
Name: Nome, dtype: object

In [221]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4      Thor                     9      0
88                5   Clarice                    10      0

In [222]:
df3.loc[2222, 'Nome']

'Thor'

In [223]:
df3.iloc[3,1] = 'Cão_Thor'

In [224]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [225]:
df3.iloc[-1]

Identificacao                 5
Nome                    Clarice
identificacao_mais_5         10
index                         0
Name: 88, dtype: object

In [226]:
df3.iloc[-1,-2]

10

In [227]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [228]:
df3.loc[29,['identificacao_mais_5','Nome']]

identificacao_mais_5          6
Nome                    Leandro
Name: 29, dtype: object

In [229]:
df3.loc[[0,2222]]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4  Cão_Thor                     9      0

In [230]:
df3.iloc[[1,3]]

      Identificacao      Nome  identificacao_mais_5  index
0                 2  Dulcinea                     7      0
2222              4  Cão_Thor                     9      0

In [231]:


tabela = {'nome': ['Leandro','Dulci','Theo'],
          'Idade': [37,41,2]}

df_tabela = pd.DataFrame(tabela)

In [232]:
display(df_tabela)

      nome  Idade
0  Leandro     37
1    Dulci     41
2     Theo      2

In [233]:
df_tabela['famila'] = ['marido','esposa','filho']

In [234]:
df_tabela

      nome  Idade  famila
0  Leandro     37  marido
1    Dulci     41  esposa
2     Theo      2   filho

In [235]:

df_tabela.drop(columns=['Idade'])

      nome  famila
0  Leandro  marido
1    Dulci  esposa
2     Theo   filho

In [236]:
nomes_tabela = df_tabela.loc[:,'nome']

In [237]:
nomes_tabela

0    Leandro
1      Dulci
2       Theo
Name: nome, dtype: object

## Atributos de Dataframe

In [238]:
df3

      Identificacao      Nome  identificacao_mais_5  index
29                1   Leandro                     6      0
0                 2  Dulcinea                     7      0
1                 3      Theo                     8      0
2222              4  Cão_Thor                     9      0
88                5   Clarice                    10      0

In [239]:
df3.dtypes

Identificacao            int64
Nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [240]:
df3.Identificacao =df3.Identificacao.astype(str)

In [241]:
df3.dtypes

Identificacao           object
Nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [242]:
df3['teste1'] = [None, 2,4, None,10]

In [243]:
df3

     Identificacao      Nome  identificacao_mais_5  index  teste1
29               1   Leandro                     6      0     NaN
0                2  Dulcinea                     7      0     2.0
1                3      Theo                     8      0     4.0
2222             4  Cão_Thor                     9      0     NaN
88               5   Clarice                    10      0    10.0

In [244]:
df3.dtypes

Identificacao            object
Nome                     object
identificacao_mais_5      int64
index                     int64
teste1                  float64
dtype: object

In [245]:
df3.loc[:,'teste1']

29       NaN
0        2.0
1        4.0
2222     NaN
88      10.0
Name: teste1, dtype: float64

In [246]:
#     indices, columns     
df3.loc[29,'teste1'] = 3

In [247]:
df3

     Identificacao      Nome  identificacao_mais_5  index  teste1
29               1   Leandro                     6      0     3.0
0                2  Dulcinea                     7      0     2.0
1                3      Theo                     8      0     4.0
2222             4  Cão_Thor                     9      0     NaN
88               5   Clarice                    10      0    10.0

In [248]:
df3.columns

Index(['Identificacao', 'Nome', 'identificacao_mais_5', 'index', 'teste1'], dtype='object')

In [249]:
df3.columns = ['Identificacao', 'Nome', 'identificacao_mais_5', 'index_modificado', 'teste1']

In [250]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     3.0
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [251]:
df3.index

Index([29, 0, 1, 2222, 88], dtype='int64')

In [252]:
df3.shape

(5, 5)

In [253]:
df3.values

array([['1', 'Leandro', 6, 0, 3.0],
       ['2', 'Dulcinea', 7, 0, 2.0],
       ['3', 'Theo', 8, 0, 4.0],
       ['4', 'Cão_Thor', 9, 0, nan],
       ['5', 'Clarice', 10, 0, 10.0]], dtype=object)

### Metodos I

##### combine_first

In [254]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     3.0
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [255]:
df3.loc[29, 'teste1'] = None

In [256]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [257]:
df3.teste1.combine_first(df3['identificacao_mais_5'])

29       6.0
0        2.0
1        4.0
2222     9.0
88      10.0
Name: teste1, dtype: float64

#### Copy

In [258]:
df1000 = df3.copy()

In [259]:
df1000

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [260]:
df1000.count()

Identificacao           5
Nome                    5
identificacao_mais_5    5
index_modificado        5
teste1                  3
dtype: int64

### drop

In [261]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [262]:
df3.drop(columns=['index_modificado'])

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN
88               5   Clarice                    10    10.0

In [263]:
df3

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [264]:
df3.drop(columns=['index_modificado'], inplace=True)

In [265]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN
88               5   Clarice                    10    10.0

In [266]:
df3.drop(index=[88], inplace=True)

In [267]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

#### drop_duplicates

In [268]:
df7 = pd.concat([df1000,df1000])

In [269]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [270]:
df7.drop_duplicates(inplace=True)

In [271]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

#### dropna

In [272]:
df8 = df7.copy()

In [273]:
df8

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [274]:
df8.dropna(inplace=True)

In [275]:
df8

   Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
0              2  Dulcinea                     7                 0     2.0
1              3      Theo                     8                 0     4.0
88             5   Clarice                    10                 0    10.0

#### fillna

In [276]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [277]:
df7.fillna('NULO', inplace=True)

C:\Users\Leandro\AppData\Local\Temp\ipykernel_19828\928111277.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'NULO' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df7.fillna('NULO', inplace=True)

In [278]:
df7

     Identificacao      Nome  identificacao_mais_5  index_modificado teste1
29               1   Leandro                     6                 0   NULO
0                2  Dulcinea                     7                 0    2.0
1                3      Theo                     8                 0    4.0
2222             4  Cão_Thor                     9                 0   NULO
88               5   Clarice                    10                 0   10.0

#### head

In [279]:
df7.head(2)

   Identificacao      Nome  identificacao_mais_5  index_modificado teste1
29             1   Leandro                     6                 0   NULO
0              2  Dulcinea                     7                 0    2.0

#### tail

In [280]:
df7.tail(2)

     Identificacao      Nome  identificacao_mais_5  index_modificado teste1
2222             4  Cão_Thor                     9                 0   NULO
88               5   Clarice                    10                 0   10.0

#### gropby

In [281]:
df10 = pd.concat([df1000,df1000])

In [282]:
df10

     Identificacao      Nome  identificacao_mais_5  index_modificado  teste1
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0
29               1   Leandro                     6                 0     NaN
0                2  Dulcinea                     7                 0     2.0
1                3      Theo                     8                 0     4.0
2222             4  Cão_Thor                     9                 0     NaN
88               5   Clarice                    10                 0    10.0

In [283]:
df10.groupby(['Nome']).identificacao_mais_5.sum()

Nome
Clarice     20
Cão_Thor    18
Dulcinea    14
Leandro     12
Theo        16
Name: identificacao_mais_5, dtype: int64

### Modulos II

In [284]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

#### isin

In [285]:
df3.isin([2,4])

      Identificacao   Nome  identificacao_mais_5  teste1
29            False  False                 False   False
0             False  False                 False    True
1             False  False                 False    True
2222          False  False                 False   False

In [286]:
df3.isin(['2','4'])

      Identificacao   Nome  identificacao_mais_5  teste1
29            False  False                 False   False
0              True  False                 False   False
1             False  False                 False   False
2222           True  False                 False   False

In [287]:
df3[df3.isin(['2','4']) == True]

     Identificacao Nome  identificacao_mais_5  teste1
29             NaN  NaN                   NaN     NaN
0                2  NaN                   NaN     NaN
1              NaN  NaN                   NaN     NaN
2222             4  NaN                   NaN     NaN

In [288]:
df3[df3.Identificacao.isin(['2','4']) == True]

     Identificacao      Nome  identificacao_mais_5  teste1
0                2  Dulcinea                     7     2.0
2222             4  Cão_Thor                     9     NaN

In [289]:
df3[df3.teste1.isin([2,4]) == True]

  Identificacao      Nome  identificacao_mais_5  teste1
0             2  Dulcinea                     7     2.0
1             3      Theo                     8     4.0

In [290]:
df3.dtypes

Identificacao            object
Nome                     object
identificacao_mais_5      int64
teste1                  float64
dtype: object

#### operacoes

In [291]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

In [292]:
df3.identificacao_mais_5.min()

6

In [293]:
df3.identificacao_mais_5.max()

9

In [294]:
df3.identificacao_mais_5.mean()

7.5

In [295]:
df3.identificacao_mais_5.median()

7.5

In [296]:
df3.identificacao_mais_5.sum()

30

In [297]:
df3.Identificacao.sum()

'1234'

In [298]:
df3.identificacao_mais_5.std()

1.2909944487358056

#### notnull

In [299]:
df3

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

In [300]:
df3.teste1.notnull()

29      False
0        True
1        True
2222    False
Name: teste1, dtype: bool

In [301]:
df3[df3.teste1.notnull() == False]

     Identificacao      Nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
2222             4  Cão_Thor                     9     NaN

In [302]:
df3[df3.teste1.notnull() == True]

  Identificacao      Nome  identificacao_mais_5  teste1
0             2  Dulcinea                     7     2.0
1             3      Theo                     8     4.0

### rename

In [303]:
df3.rename(columns={'Nome': 'nome', 'Identificacao':'identificacao'}, inplace= True)

In [304]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1   Leandro                     6     NaN
0                2  Dulcinea                     7     2.0
1                3      Theo                     8     4.0
2222             4  Cão_Thor                     9     NaN

In [305]:
df3.rename(index={2222: -1}, inplace= True)

In [306]:
df3

    identificacao      nome  identificacao_mais_5  teste1
 29             1   Leandro                     6     NaN
 0              2  Dulcinea                     7     2.0
 1              3      Theo                     8     4.0
-1              4  Cão_Thor                     9     NaN

#### replace

In [307]:
df3

    identificacao      nome  identificacao_mais_5  teste1
 29             1   Leandro                     6     NaN
 0              2  Dulcinea                     7     2.0
 1              3      Theo                     8     4.0
-1              4  Cão_Thor                     9     NaN

In [308]:
df3.nome.replace('Cão_Thor','Thor', inplace=True)

In [309]:
df3

    identificacao      nome  identificacao_mais_5  teste1
 29             1   Leandro                     6     NaN
 0              2  Dulcinea                     7     2.0
 1              3      Theo                     8     4.0
-1              4      Thor                     9     NaN

#### round

In [310]:
df3['teste2'] = [1.2,3.6451,2.98018,9.13]

In [311]:
df3

    identificacao      nome  identificacao_mais_5  teste1   teste2
 29             1   Leandro                     6     NaN  1.20000
 0              2  Dulcinea                     7     2.0  3.64510
 1              3      Theo                     8     4.0  2.98018
-1              4      Thor                     9     NaN  9.13000

In [312]:
# com uma casa decimal e aredonda
df3.teste2.round(1)

 29    1.2
 0     3.6
 1     3.0
-1     9.1
Name: teste2, dtype: float64

In [313]:
# com nenhuma casa decimal e aredonda
df3.teste2.round(0)

 29    1.0
 0     4.0
 1     3.0
-1     9.0
Name: teste2, dtype: float64

In [314]:

df3.teste2 = df3.teste2.round(1)

In [315]:
df3

    identificacao      nome  identificacao_mais_5  teste1  teste2
 29             1   Leandro                     6     NaN     1.2
 0              2  Dulcinea                     7     2.0     3.6
 1              3      Theo                     8     4.0     3.0
-1              4      Thor                     9     NaN     9.1

#### to_clipboard()

In [316]:
df3.to_clipboard()

In [317]:
df3.to_clipboard(index=False)